StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_recv.c
	/* receive the frames that ra(a1) is my address */
	if (!_rtw_memcmp(GetAddr1Ptr(pframe), adapter_mac_addr(padapter), ETH_ALEN)) {
		return _FAIL;
	}

	psta = rtw_get_stainfo(pstapriv, get_addr2_ptr(pframe));
	if (psta == NULL) {
		return _FAIL;
	}

	/* for rx pkt statistics */
	psta->sta_stats.last_rx_time = rtw_get_current_time();
	psta->sta_stats.rx_ctrl_pkts++;

	/* only handle ps-poll */
	if (get_frame_sub_type(pframe) == WIFI_PSPOLL) {
#ifdef CONFIG_AP_MODE
		u16 aid;
		u8 wmmps_ac = 0;

		aid = GetAid(pframe);
		if (psta->cmn.aid != aid) {
			return _FAIL;
		}

		switch (pattrib->priority) {
		case 1:
		case 2:
			wmmps_ac = psta->uapsd_bk & BIT(0);
			break;
		case 4:
		case 5:
			wmmps_ac = psta->uapsd_vi & BIT(0);
			break;
		case 6:
		case 7:
			wmmps_ac = psta->uapsd_vo & BIT(0);
			break;
		case 0:
		case 3:
		default:
			wmmps_ac = psta->uapsd_be & BIT(0);
			break;
		}

		if (wmmps_ac) {
			return _FAIL;
		}

		if (psta->state & WIFI_STA_ALIVE_CHK_STATE) {
			RTW_INFO("%s alive check-rx ps-poll\n", __func__);
			psta->expire_to = pstapriv->expire_to;
			psta->state ^= WIFI_STA_ALIVE_CHK_STATE;
		}

		if ((psta->state & WIFI_SLEEP_STATE) && (rtw_tim_map_is_set(padapter, pstapriv->sta_dz_bitmap, psta->cmn.aid))) {
			_irqL irqL;
			_list	*xmitframe_plist, *xmitframe_phead;
			struct xmit_frame *pxmitframe = NULL;
			struct xmit_priv *pxmitpriv = &padapter->xmitpriv;

			/* _enter_critical_bh(&psta->sleep_q.lock, &irqL); */
			_enter_critical_bh(&pxmitpriv->lock, &irqL);

#ifdef CONFIG_RTW_MGMT_QUEUE
			xmitframe_phead = get_list_head(&psta->mgmt_sleep_q);
			xmitframe_plist = get_next(xmitframe_phead);

			if ((rtw_end_of_queue_search(xmitframe_phead, xmitframe_plist)) == _FALSE) {
				pxmitframe = LIST_CONTAINOR(xmitframe_plist, struct xmit_frame, list);

				xmitframe_plist = get_next(xmitframe_plist);

				rtw_list_delete(&pxmitframe->list);

#ifdef DBG_MGMT_QUEUE
				RTW_INFO("%s seq_num = %u, subtype = 0x%x\n",
					 __func__, pxmitframe->attrib.seqnum, pxmitframe->attrib.subtype);
#endif

				psta->mgmt_sleepq_len--;

				if (psta->mgmt_sleepq_len > 0) {
					pxmitframe->attrib.mdata = 1;
				} else {
					pxmitframe->attrib.mdata = 0;
				}

				pxmitframe->attrib.triggered = 1;

				rtw_hal_mgmt_xmitframe_enqueue(padapter, pxmitframe);

				mgmtq_null = _FALSE;
			}
#endif
			xmitframe_phead = get_list_head(&psta->sleep_q);
			xmitframe_plist = get_next(xmitframe_phead);

			if ((rtw_end_of_queue_search(xmitframe_phead, xmitframe_plist)) == _FALSE) {
				pxmitframe = LIST_CONTAINOR(xmitframe_plist, struct xmit_frame, list);

				xmitframe_plist = get_next(xmitframe_plist);

				rtw_list_delete(&pxmitframe->list);

				psta->sleepq_len--;

				if (psta->sleepq_len > 0) {
					pxmitframe->attrib.mdata = 1;
				} else {
					pxmitframe->attrib.mdata = 0;
				}

				pxmitframe->attrib.triggered = 1;

				/* RTW_INFO("handling ps-poll, q_len=%d\n", psta->sleepq_len); */
				/* RTW_INFO_DUMP("handling, tim=", pstapriv->tim_bitmap, pstapriv->aid_bmp_len); */

#if 0
				_exit_critical_bh(&psta->sleep_q.lock, &irqL);
				if (rtw_hal_xmit(padapter, pxmitframe) == _TRUE) {
					rtw_os_xmit_complete(padapter, pxmitframe);
				}
				_enter_critical_bh(&psta->sleep_q.lock, &irqL);
#endif
				rtw_hal_xmitframe_enqueue(padapter, pxmitframe);

				dataq_null = _FALSE;
			}

			_exit_critical_bh(&pxmitpriv->lock, &irqL);
			/* _exit_critical_bh(&psta->sleep_q.lock, &irqL); */

			/* Error handler : TIM is setted, but data queue and management queue is empty. */
			if (dataq_null
#ifdef CONFIG_RTW_MGMT_QUEUE
			    && mgmtq_null
#endif
			    && rtw_tim_map_is_set(padapter, pstapriv->tim_bitmap, psta->cmn.aid)) {

				if (psta->sleepq_len == 0
#ifdef CONFIG_RTW_MGMT_QUEUE
				    && psta->mgmt_sleepq_len == 0
#endif
				   ) {
					RTW_INFO("No buffered packets to xmit\n");

					/* issue nulldata with More data bit = 0 to indicate we have no buffered packets */
					issue_nulldata(padapter, psta->cmn.mac_addr, 0, 0, 0);
				} else {
					if (psta->sleepq_len != 0) {
						RTW_INFO("error!psta->sleepq_len=%d\n", psta->sleepq_len);
						psta->sleepq_len = 0;
					}
#ifdef CONFIG_RTW_MGMT_QUEUE
					if (psta->mgmt_sleepq_len != 0) {
						RTW_INFO("error!psta->mgmt_sleepq_len=%d\n", psta->mgmt_sleepq_len);
						psta->mgmt_sleepq_len = 0;
					}
#endif
				}
			}

			if (psta->sleepq_len == 0
#ifdef CONFIG_RTW_MGMT_QUEUE
			    && psta->mgmt_sleepq_len == 0
#endif
			   ) {
				rtw_tim_map_clear(padapter, pstapriv->tim_bitmap, psta->cmn.aid);

				/* upate BCN for TIM IE */
				update_beacon(padapter, _TIM_IE_, NULL, _TRUE, 0);
			}
		}
#endif /* CONFIG_AP_MODE */
	} else if (get_frame_sub_type(pframe) == WIFI_NDPA) {
#ifdef CONFIG_BEAMFORMING
		rtw_beamforming_get_ndpa_frame(padapter, precv_frame);
#endif/*CONFIG_BEAMFORMING*/
	} else if (get_frame_sub_type(pframe) == WIFI_BAR) {
		rtw_process_bar_frame(padapter, precv_frame);
	}

	return _FAIL;

}

#if defined(CONFIG_IEEE80211W) || defined(CONFIG_RTW_MESH)
static sint validate_mgmt_protect(_adapter *adapter, union recv_frame *precv_frame)
{
#define DBG_VALIDATE_MGMT_PROTECT 0
#define DBG_VALIDATE_MGMT_DEC 0

	struct security_priv *sec = &adapter->securitypriv;
	struct rx_pkt_attrib *pattrib = &precv_frame->u.hdr.attrib;
	struct sta_info	*psta = precv_frame->u.hdr.psta;
	u8 *ptr;
	u8 type;
	u8 subtype;
	u8 is_bmc;
	u8 category = 0xFF;

#ifdef CONFIG_IEEE80211W
	const u8 *igtk;
	u16 igtk_id;
	u64 *ipn;
	enum security_type bip_cipher;
#endif

	u8 *mgmt_DATA;
	u32 data_len = 0;

	sint ret;

#ifdef CONFIG_RTW_MESH
	if (MLME_IS_MESH(adapter)) {
		if (!adapter->mesh_info.mesh_auth_id) {
			return pattrib->privacy ? _FAIL : _SUCCESS;
		}
	} else
#endif
		if (SEC_IS_BIP_KEY_INSTALLED(sec) == _FALSE) {
			return _SUCCESS;
		}

	ptr = precv_frame->u.hdr.rx_data;
	type = GetFrameType(ptr);
	subtype = get_frame_sub_type(ptr); /* bit(7)~bit(2) */
	is_bmc = IS_MCAST(GetAddr1Ptr(ptr));

#if DBG_VALIDATE_MGMT_PROTECT
	if (subtype == WIFI_DEAUTH) {
		RTW_INFO(FUNC_ADPT_FMT" bmc:%u, deauth, privacy:%u, encrypt:%u, bdecrypted:%u\n"
			 , FUNC_ADPT_ARG(adapter)
			 , is_bmc, pattrib->privacy, pattrib->encrypt, pattrib->bdecrypted);
	} else if (subtype == WIFI_DISASSOC) {
		RTW_INFO(FUNC_ADPT_FMT" bmc:%u, disassoc, privacy:%u, encrypt:%u, bdecrypted:%u\n"
			 , FUNC_ADPT_ARG(adapter)
			 , is_bmc, pattrib->privacy, pattrib->encrypt, pattrib->bdecrypted);
	}
	if (subtype == WIFI_ACTION) {
		if (pattrib->privacy) {
			RTW_INFO(FUNC_ADPT_FMT" bmc:%u, action(?), privacy:%u, encrypt:%u, bdecrypted:%u\n"
				 , FUNC_ADPT_ARG(adapter)
				 , is_bmc, pattrib->privacy, pattrib->encrypt, pattrib->bdecrypted);
		} else {
			RTW_INFO(FUNC_ADPT_FMT" bmc:%u, action(%u), privacy:%u, encrypt:%u, bdecrypted:%u\n"
				 , FUNC_ADPT_ARG(adapter), is_bmc
				 , *(ptr + sizeof(struct rtw_ieee80211_hdr_3addr))
				 , pattrib->privacy, pattrib->encrypt, pattrib->bdecrypted);
		}
	}
#endif

	if (!pattrib->privacy) {
		if (!psta || !(psta->flags & WLAN_STA_MFP)) {
			/* peer is not MFP capable, no need to check */
			goto exit;
		}

		if (subtype == WIFI_ACTION) {
			category = *(ptr + sizeof(struct rtw_ieee80211_hdr_3addr));
		}

